#탈출문자

# \n : 줄바꿈
print("백문이 불여일견\n백견이 불여일타")

print('''백문이 불여일견 
백견이 불여일타''')

#\' \" : 문장내에서 따옴표
#저는 "나도코딩"입니다.
#print("저는 "나도코딩"입니다") 연속된 따옴표 덩어리를 문자열로 보기 떄문에 오류 발생 

print("저는 '나도코딩'입니다")
print('저는 "나도코딩"입니다.')
print("저는 \"나도코딩\"입니다")

#\\ : 문장내에서 \, 그냥 \ 하면 바로뒤에 문자랑 엮어서 탈출문자로 인식한다.
print("C:\\Users\\이승우\\Desktop\\python workspace")

#\r : 커서를 맨 앞으로 이동해준다
print("Red apple\rpine") #커서를 앞으로 옮긴다음 해당 내용을 '대체해서' 쓴다.

#\b : 백스페이스 커서를 왼쪽으로 한칸이동 (한글자 삭제후 쓴다.)
print("Redd\bapple")

#/t : 탭 
print("red\tapple")