#빈 자리는 빈공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보
print("{0: >10}".format(500)) #콜론과 꺽새 사이 문자 (여기서는 띄어쓰기)로 10개를 채우고 오른쪽 정렬
                              #7자리 스페이스 500

#양수일 땐 + 표시, 음수일때는 - 표시
print("{0: >+10}".format(500)) #양수여도 +500으로 부호포함 출력
print("{0: >+10}".format(-500)) #-500

#왼쪽 정렬하고, 빈칸으로_로 채움
print("{0:_<10}".format(500))

#3자리마다 콤마를 찍어주기 
print("{0:,}".format(10000000000000))

#3자리 마다 콤마를 찍어주기, +-부호도 붙이기
print("{0:+,}".format(100000000000000000))

#3자리마다 콤마를 찍어주기, 부호도 붙이고, 자리수 확보하기
#돈이 많으면 행복하니까 빈자리는 ^ 로 채워주기
print("{0:^<+30,}".format(100000000000)) #,는 항상 마지막
#순서 index : 채울문자 정렬 부호 자리 콤마

#소수점 출력
print("{0:f}".format(2)) #int를 소수로 출력함, 디폴트 아래 6자리까지
print("{0:.2f}".format(5/3)) # 소수 둘째짜리까지 출력, 셋째에서 반올림 
