'''
quiz)
당신은 cocoa 서비스를 이용하는 택시 기사님입니다.
50명의 승객과 매칭 기회가 있을 때, 총 탑승 승객 수를 구하는 프로그램을 작성하시오.

조건1 : 승객별 운행 소요 시간은 5분 ~ 50분 사이의 난수로 정해집니다.
조건2 : 당신은 소요시간 5분 ~ 15분 사이의 승객만 매칭해야합니다.

(출력문 예제)
[0] 1번째 손님 (소요시간 : 15분)
[ ] 2번째 손님 (소요시간 : 50분)
[0] 3번째 손님 (소요시간 : 5분)
...
[ ] 50번째 손님 (소요시간 : 16분)

총 탑승 승객 : 2분
'''

#풀이

from random import *

total = 0
for passenger in range(1,51): #50명 승객
    time = randint(5,50) #5이상 50이하 정수 랜덤 수
    if 5 <= time <= 15:
        print("[o] {0}번째 손님 (소요시간 : {1}분)".format(passenger, time))
        total += 1
    else:
        print("[x] {0}번째 손님 (소요시간 : {1}분)".format(passenger, time))
    
print("총 탑승 승객 : {0}".format(total))

